Test/Jerome_Test/Framework/IIS/xml/20-1_srr_wsn_subscribeRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tops="http://www.tmforum.org/mtop/fmw/xsd/topics/v1-0" xmlns:wsn="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/ http://docs.oasis-open.org/wsn/b-2 http://docs.oasis-open.org/wsn/b-2.xsd">
  <SOAP-ENV:Header>
    <wsa:To>http://host:port/NotificationProducerV1-0</wsa:To>
    <wsa:Action>http://www.tmforum.org/mtop/fmw/wsdl/notp/v1-0/Subscribe</wsa:Action>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <wsn:Subscribe>
      <wsn:ConsumerReference>
        <wsa:Address>http://host:port/NotificationConsumerV1-0</wsa:Address>
      </wsn:ConsumerReference>
      <wsn:Filter>
        <wsn:TopicExpression Dialect=""></wsn:TopicExpression>
        <wsn:Topic Dialect="http://docs.oasis-open.org/wsn/t-1/TopicExpression/Simple">tops:Inventory</wsn:Topic>
      </wsn:Filter>
    </wsn:Subscribe>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
